Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/pio/pic32ck2051sg01144.h
#define PIN_PB12B_ADC_VINP11                       _UINT32_(44)
#define MUX_PB12B_ADC_VINP11                       _UINT32_(1) 
#define PINMUX_PB12B_ADC_VINP11                    ((PIN_PB12B_ADC_VINP11 << 16) | MUX_PB12B_ADC_VINP11)
#define PORT_PB12B_ADC_VINP11                      (_UINT32_(1) << 12)

#define PIN_PB01B_ADC_VREFP0                       _UINT32_(33)
#define MUX_PB01B_ADC_VREFP0                       _UINT32_(1) 
#define PINMUX_PB01B_ADC_VREFP0                    ((PIN_PB01B_ADC_VREFP0 << 16) | MUX_PB01B_ADC_VREFP0)
#define PORT_PB01B_ADC_VREFP0                      (_UINT32_(1) << 1)

/* ========== PORT definition for CAN0 peripheral ========== */
#define PIN_PB09H_CAN0_RX                          _UINT32_(41)
#define MUX_PB09H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PB09H_CAN0_RX                       ((PIN_PB09H_CAN0_RX << 16) | MUX_PB09H_CAN0_RX)
#define PORT_PB09H_CAN0_RX                         (_UINT32_(1) << 9)

#define PIN_PB17H_CAN0_RX                          _UINT32_(49)
#define MUX_PB17H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PB17H_CAN0_RX                       ((PIN_PB17H_CAN0_RX << 16) | MUX_PB17H_CAN0_RX)
#define PORT_PB17H_CAN0_RX                         (_UINT32_(1) << 17)

#define PIN_PB22H_CAN0_RX                          _UINT32_(54)
#define MUX_PB22H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PB22H_CAN0_RX                       ((PIN_PB22H_CAN0_RX << 16) | MUX_PB22H_CAN0_RX)
#define PORT_PB22H_CAN0_RX                         (_UINT32_(1) << 22)

#define PIN_PC03H_CAN0_RX                          _UINT32_(67)
#define MUX_PC03H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PC03H_CAN0_RX                       ((PIN_PC03H_CAN0_RX << 16) | MUX_PC03H_CAN0_RX)
#define PORT_PC03H_CAN0_RX                         (_UINT32_(1) << 3)

#define PIN_PD19H_CAN0_RX                          _UINT32_(115)
#define MUX_PD19H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PD19H_CAN0_RX                       ((PIN_PD19H_CAN0_RX << 16) | MUX_PD19H_CAN0_RX)
#define PORT_PD19H_CAN0_RX                         (_UINT32_(1) << 19)

#define PIN_PB08H_CAN0_TX                          _UINT32_(40)
#define MUX_PB08H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PB08H_CAN0_TX                       ((PIN_PB08H_CAN0_TX << 16) | MUX_PB08H_CAN0_TX)
#define PORT_PB08H_CAN0_TX                         (_UINT32_(1) << 8)

#define PIN_PB16H_CAN0_TX                          _UINT32_(48)
#define MUX_PB16H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PB16H_CAN0_TX                       ((PIN_PB16H_CAN0_TX << 16) | MUX_PB16H_CAN0_TX)
#define PORT_PB16H_CAN0_TX                         (_UINT32_(1) << 16)

#define PIN_PB21H_CAN0_TX                          _UINT32_(53)
#define MUX_PB21H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PB21H_CAN0_TX                       ((PIN_PB21H_CAN0_TX << 16) | MUX_PB21H_CAN0_TX)
#define PORT_PB21H_CAN0_TX                         (_UINT32_(1) << 21)

#define PIN_PC02H_CAN0_TX                          _UINT32_(66)
#define MUX_PC02H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PC02H_CAN0_TX                       ((PIN_PC02H_CAN0_TX << 16) | MUX_PC02H_CAN0_TX)
#define PORT_PC02H_CAN0_TX                         (_UINT32_(1) << 2)

#define PIN_PD18H_CAN0_TX                          _UINT32_(114)
#define MUX_PD18H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PD18H_CAN0_TX                       ((PIN_PD18H_CAN0_TX << 16) | MUX_PD18H_CAN0_TX)
#define PORT_PD18H_CAN0_TX                         (_UINT32_(1) << 18)

/* ========== PORT definition for CAN1 peripheral ========== */
#define PIN_PB01H_CAN1_RX                          _UINT32_(33)
#define MUX_PB01H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PB01H_CAN1_RX                       ((PIN_PB01H_CAN1_RX << 16) | MUX_PB01H_CAN1_RX)
#define PORT_PB01H_CAN1_RX                         (_UINT32_(1) << 1)

#define PIN_PB24H_CAN1_RX                          _UINT32_(56)
#define MUX_PB24H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PB24H_CAN1_RX                       ((PIN_PB24H_CAN1_RX << 16) | MUX_PB24H_CAN1_RX)
#define PORT_PB24H_CAN1_RX                         (_UINT32_(1) << 24)

#define PIN_PC07H_CAN1_RX                          _UINT32_(71)
#define MUX_PC07H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PC07H_CAN1_RX                       ((PIN_PC07H_CAN1_RX << 16) | MUX_PC07H_CAN1_RX)
#define PORT_PC07H_CAN1_RX                         (_UINT32_(1) << 7)

#define PIN_PD21H_CAN1_RX                          _UINT32_(117)
#define MUX_PD21H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PD21H_CAN1_RX                       ((PIN_PD21H_CAN1_RX << 16) | MUX_PD21H_CAN1_RX)
#define PORT_PD21H_CAN1_RX                         (_UINT32_(1) << 21)

#define PIN_PB00H_CAN1_TX                          _UINT32_(32)
#define MUX_PB00H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PB00H_CAN1_TX                       ((PIN_PB00H_CAN1_TX << 16) | MUX_PB00H_CAN1_TX)
#define PORT_PB00H_CAN1_TX                         (_UINT32_(1) << 0)

#define PIN_PB23H_CAN1_TX                          _UINT32_(55)
#define MUX_PB23H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PB23H_CAN1_TX                       ((PIN_PB23H_CAN1_TX << 16) | MUX_PB23H_CAN1_TX)
#define PORT_PB23H_CAN1_TX                         (_UINT32_(1) << 23)

#define PIN_PC06H_CAN1_TX                          _UINT32_(70)
#define MUX_PC06H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PC06H_CAN1_TX                       ((PIN_PC06H_CAN1_TX << 16) | MUX_PC06H_CAN1_TX)
#define PORT_PC06H_CAN1_TX                         (_UINT32_(1) << 6)

#define PIN_PD20H_CAN1_TX                          _UINT32_(116)
#define MUX_PD20H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PD20H_CAN1_TX                       ((PIN_PD20H_CAN1_TX << 16) | MUX_PD20H_CAN1_TX)
#define PORT_PD20H_CAN1_TX                         (_UINT32_(1) << 20)

/* ========== PORT definition for CCL peripheral ========== */
#define PIN_PB07M_CCL_IN0                          _UINT32_(39)
#define MUX_PB07M_CCL_IN0                          _UINT32_(12)
#define PINMUX_PB07M_CCL_IN0                       ((PIN_PB07M_CCL_IN0 << 16) | MUX_PB07M_CCL_IN0)
#define PORT_PB07M_CCL_IN0                         (_UINT32_(1) << 7)

