Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/pio/pic32ck2051sg01144.h
#define PIN_PD15E_EBI_NCS3                         _UINT32_(111)
#define MUX_PD15E_EBI_NCS3                         _UINT32_(4) 
#define PINMUX_PD15E_EBI_NCS3                      ((PIN_PD15E_EBI_NCS3 << 16) | MUX_PD15E_EBI_NCS3)
#define PORT_PD15E_EBI_NCS3                        (_UINT32_(1) << 15)

#define PIN_PB15E_EBI_NRD                          _UINT32_(47)
#define MUX_PB15E_EBI_NRD                          _UINT32_(4) 
#define PINMUX_PB15E_EBI_NRD                       ((PIN_PB15E_EBI_NRD << 16) | MUX_PB15E_EBI_NRD)
#define PORT_PB15E_EBI_NRD                         (_UINT32_(1) << 15)

#define PIN_PA10E_EBI_NWAIT                        _UINT32_(10)
#define MUX_PA10E_EBI_NWAIT                        _UINT32_(4) 
#define PINMUX_PA10E_EBI_NWAIT                     ((PIN_PA10E_EBI_NWAIT << 16) | MUX_PA10E_EBI_NWAIT)
#define PORT_PA10E_EBI_NWAIT                       (_UINT32_(1) << 10)

#define PIN_PC22E_EBI_NWAIT                        _UINT32_(86)
#define MUX_PC22E_EBI_NWAIT                        _UINT32_(4) 
#define PINMUX_PC22E_EBI_NWAIT                     ((PIN_PC22E_EBI_NWAIT << 16) | MUX_PC22E_EBI_NWAIT)
#define PORT_PC22E_EBI_NWAIT                       (_UINT32_(1) << 22)

#define PIN_PD11E_EBI_NWAIT                        _UINT32_(107)
#define MUX_PD11E_EBI_NWAIT                        _UINT32_(4) 
#define PINMUX_PD11E_EBI_NWAIT                     ((PIN_PD11E_EBI_NWAIT << 16) | MUX_PD11E_EBI_NWAIT)
#define PORT_PD11E_EBI_NWAIT                       (_UINT32_(1) << 11)

#define PIN_PC24E_EBI_NWE_NWR0                     _UINT32_(88)
#define MUX_PC24E_EBI_NWE_NWR0                     _UINT32_(4) 
#define PINMUX_PC24E_EBI_NWE_NWR0                  ((PIN_PC24E_EBI_NWE_NWR0 << 16) | MUX_PC24E_EBI_NWE_NWR0)
#define PORT_PC24E_EBI_NWE_NWR0                    (_UINT32_(1) << 24)

#define PIN_PD05E_EBI_NWE_NWR0                     _UINT32_(101)
#define MUX_PD05E_EBI_NWE_NWR0                     _UINT32_(4) 
#define PINMUX_PD05E_EBI_NWE_NWR0                  ((PIN_PD05E_EBI_NWE_NWR0 << 16) | MUX_PD05E_EBI_NWE_NWR0)
#define PORT_PD05E_EBI_NWE_NWR0                    (_UINT32_(1) << 5)

/* ========== PORT definition for EIC peripheral ========== */
#define PIN_PA16A_EIC_EXTINT0                      _UINT32_(16)
#define MUX_PA16A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PA16A_EIC_EXTINT0                   ((PIN_PA16A_EIC_EXTINT0 << 16) | MUX_PA16A_EIC_EXTINT0)
#define PORT_PA16A_EIC_EXTINT0                     (_UINT32_(1) << 16)
#define PIN_PA16A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PA16 External Interrupt Line */

#define PIN_PB00A_EIC_EXTINT0                      _UINT32_(32)
#define MUX_PB00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PB00A_EIC_EXTINT0                   ((PIN_PB00A_EIC_EXTINT0 << 16) | MUX_PB00A_EIC_EXTINT0)
#define PORT_PB00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PB00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PB00 External Interrupt Line */

#define PIN_PB16A_EIC_EXTINT0                      _UINT32_(48)
#define MUX_PB16A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PB16A_EIC_EXTINT0                   ((PIN_PB16A_EIC_EXTINT0 << 16) | MUX_PB16A_EIC_EXTINT0)
#define PORT_PB16A_EIC_EXTINT0                     (_UINT32_(1) << 16)
#define PIN_PB16A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PB16 External Interrupt Line */

#define PIN_PC00A_EIC_EXTINT0                      _UINT32_(64)
#define MUX_PC00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PC00A_EIC_EXTINT0                   ((PIN_PC00A_EIC_EXTINT0 << 16) | MUX_PC00A_EIC_EXTINT0)
#define PORT_PC00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PC00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PC00 External Interrupt Line */

#define PIN_PC16A_EIC_EXTINT0                      _UINT32_(80)
#define MUX_PC16A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PC16A_EIC_EXTINT0                   ((PIN_PC16A_EIC_EXTINT0 << 16) | MUX_PC16A_EIC_EXTINT0)
#define PORT_PC16A_EIC_EXTINT0                     (_UINT32_(1) << 16)
#define PIN_PC16A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PC16 External Interrupt Line */

#define PIN_PD00A_EIC_EXTINT0                      _UINT32_(96)
#define MUX_PD00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PD00A_EIC_EXTINT0                   ((PIN_PD00A_EIC_EXTINT0 << 16) | MUX_PD00A_EIC_EXTINT0)
#define PORT_PD00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PD00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PD00 External Interrupt Line */

#define PIN_PD16A_EIC_EXTINT0                      _UINT32_(112)
#define MUX_PD16A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PD16A_EIC_EXTINT0                   ((PIN_PD16A_EIC_EXTINT0 << 16) | MUX_PD16A_EIC_EXTINT0)
#define PORT_PD16A_EIC_EXTINT0                     (_UINT32_(1) << 16)
#define PIN_PD16A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PD16 External Interrupt Line */

#define PIN_PA01A_EIC_EXTINT1                      _UINT32_(1) 
#define MUX_PA01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA01A_EIC_EXTINT1                   ((PIN_PA01A_EIC_EXTINT1 << 16) | MUX_PA01A_EIC_EXTINT1)
#define PORT_PA01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PA01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA01 External Interrupt Line */

#define PIN_PA17A_EIC_EXTINT1                      _UINT32_(17)
#define MUX_PA17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA17A_EIC_EXTINT1                   ((PIN_PA17A_EIC_EXTINT1 << 16) | MUX_PA17A_EIC_EXTINT1)
#define PORT_PA17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PA17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA17 External Interrupt Line */

#define PIN_PB01A_EIC_EXTINT1                      _UINT32_(33)
#define MUX_PB01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PB01A_EIC_EXTINT1                   ((PIN_PB01A_EIC_EXTINT1 << 16) | MUX_PB01A_EIC_EXTINT1)
#define PORT_PB01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PB01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PB01 External Interrupt Line */

#define PIN_PB17A_EIC_EXTINT1                      _UINT32_(49)
#define MUX_PB17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PB17A_EIC_EXTINT1                   ((PIN_PB17A_EIC_EXTINT1 << 16) | MUX_PB17A_EIC_EXTINT1)
#define PORT_PB17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PB17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PB17 External Interrupt Line */

#define PIN_PC01A_EIC_EXTINT1                      _UINT32_(65)
#define MUX_PC01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PC01A_EIC_EXTINT1                   ((PIN_PC01A_EIC_EXTINT1 << 16) | MUX_PC01A_EIC_EXTINT1)
#define PORT_PC01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PC01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PC01 External Interrupt Line */

#define PIN_PC17A_EIC_EXTINT1                      _UINT32_(81)
#define MUX_PC17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PC17A_EIC_EXTINT1                   ((PIN_PC17A_EIC_EXTINT1 << 16) | MUX_PC17A_EIC_EXTINT1)
#define PORT_PC17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PC17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PC17 External Interrupt Line */

