Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/pio/pic32ck2051sg01144.h
#define PIN_PA22K_PCC_DATA1                        _UINT32_(22)
#define MUX_PA22K_PCC_DATA1                        _UINT32_(10)
#define PINMUX_PA22K_PCC_DATA1                     ((PIN_PA22K_PCC_DATA1 << 16) | MUX_PA22K_PCC_DATA1)
#define PORT_PA22K_PCC_DATA1                       (_UINT32_(1) << 22)

#define PIN_PC02K_PCC_DATA1                        _UINT32_(66)
#define MUX_PC02K_PCC_DATA1                        _UINT32_(10)
#define PINMUX_PC02K_PCC_DATA1                     ((PIN_PC02K_PCC_DATA1 << 16) | MUX_PC02K_PCC_DATA1)
#define PORT_PC02K_PCC_DATA1                       (_UINT32_(1) << 2)

#define PIN_PA23K_PCC_DATA2                        _UINT32_(23)
#define MUX_PA23K_PCC_DATA2                        _UINT32_(10)
#define PINMUX_PA23K_PCC_DATA2                     ((PIN_PA23K_PCC_DATA2 << 16) | MUX_PA23K_PCC_DATA2)
#define PORT_PA23K_PCC_DATA2                       (_UINT32_(1) << 23)

#define PIN_PC03K_PCC_DATA2                        _UINT32_(67)
#define MUX_PC03K_PCC_DATA2                        _UINT32_(10)
#define PINMUX_PC03K_PCC_DATA2                     ((PIN_PC03K_PCC_DATA2 << 16) | MUX_PC03K_PCC_DATA2)
#define PORT_PC03K_PCC_DATA2                       (_UINT32_(1) << 3)

#define PIN_PA24K_PCC_DATA3                        _UINT32_(24)
#define MUX_PA24K_PCC_DATA3                        _UINT32_(10)
#define PINMUX_PA24K_PCC_DATA3                     ((PIN_PA24K_PCC_DATA3 << 16) | MUX_PA24K_PCC_DATA3)
#define PORT_PA24K_PCC_DATA3                       (_UINT32_(1) << 24)

#define PIN_PB07K_PCC_DATA3                        _UINT32_(39)
#define MUX_PB07K_PCC_DATA3                        _UINT32_(10)
#define PINMUX_PB07K_PCC_DATA3                     ((PIN_PB07K_PCC_DATA3 << 16) | MUX_PB07K_PCC_DATA3)
#define PORT_PB07K_PCC_DATA3                       (_UINT32_(1) << 7)

#define PIN_PA25K_PCC_DATA4                        _UINT32_(25)
#define MUX_PA25K_PCC_DATA4                        _UINT32_(10)
#define PINMUX_PA25K_PCC_DATA4                     ((PIN_PA25K_PCC_DATA4 << 16) | MUX_PA25K_PCC_DATA4)
#define PORT_PA25K_PCC_DATA4                       (_UINT32_(1) << 25)

#define PIN_PB08K_PCC_DATA4                        _UINT32_(40)
#define MUX_PB08K_PCC_DATA4                        _UINT32_(10)
#define PINMUX_PB08K_PCC_DATA4                     ((PIN_PB08K_PCC_DATA4 << 16) | MUX_PB08K_PCC_DATA4)
#define PORT_PB08K_PCC_DATA4                       (_UINT32_(1) << 8)

#define PIN_PA26K_PCC_DATA5                        _UINT32_(26)
#define MUX_PA26K_PCC_DATA5                        _UINT32_(10)
#define PINMUX_PA26K_PCC_DATA5                     ((PIN_PA26K_PCC_DATA5 << 16) | MUX_PA26K_PCC_DATA5)
#define PORT_PA26K_PCC_DATA5                       (_UINT32_(1) << 26)

#define PIN_PB09K_PCC_DATA5                        _UINT32_(41)
#define MUX_PB09K_PCC_DATA5                        _UINT32_(10)
#define PINMUX_PB09K_PCC_DATA5                     ((PIN_PB09K_PCC_DATA5 << 16) | MUX_PB09K_PCC_DATA5)
#define PORT_PB09K_PCC_DATA5                       (_UINT32_(1) << 9)

#define PIN_PA27K_PCC_DATA6                        _UINT32_(27)
#define MUX_PA27K_PCC_DATA6                        _UINT32_(10)
#define PINMUX_PA27K_PCC_DATA6                     ((PIN_PA27K_PCC_DATA6 << 16) | MUX_PA27K_PCC_DATA6)
#define PORT_PA27K_PCC_DATA6                       (_UINT32_(1) << 27)

#define PIN_PB10K_PCC_DATA6                        _UINT32_(42)
#define MUX_PB10K_PCC_DATA6                        _UINT32_(10)
#define PINMUX_PB10K_PCC_DATA6                     ((PIN_PB10K_PCC_DATA6 << 16) | MUX_PB10K_PCC_DATA6)
#define PORT_PB10K_PCC_DATA6                       (_UINT32_(1) << 10)

#define PIN_PA28K_PCC_DATA7                        _UINT32_(28)
#define MUX_PA28K_PCC_DATA7                        _UINT32_(10)
#define PINMUX_PA28K_PCC_DATA7                     ((PIN_PA28K_PCC_DATA7 << 16) | MUX_PA28K_PCC_DATA7)
#define PORT_PA28K_PCC_DATA7                       (_UINT32_(1) << 28)

#define PIN_PC00K_PCC_DATA7                        _UINT32_(64)
#define MUX_PC00K_PCC_DATA7                        _UINT32_(10)
#define PINMUX_PC00K_PCC_DATA7                     ((PIN_PC00K_PCC_DATA7 << 16) | MUX_PC00K_PCC_DATA7)
#define PORT_PC00K_PCC_DATA7                       (_UINT32_(1) << 0)

#define PIN_PB18K_PCC_DATA8                        _UINT32_(50)
#define MUX_PB18K_PCC_DATA8                        _UINT32_(10)
#define PINMUX_PB18K_PCC_DATA8                     ((PIN_PB18K_PCC_DATA8 << 16) | MUX_PB18K_PCC_DATA8)
#define PORT_PB18K_PCC_DATA8                       (_UINT32_(1) << 18)

#define PIN_PC15K_PCC_DATA8                        _UINT32_(79)
#define MUX_PC15K_PCC_DATA8                        _UINT32_(10)
#define PINMUX_PC15K_PCC_DATA8                     ((PIN_PC15K_PCC_DATA8 << 16) | MUX_PC15K_PCC_DATA8)
#define PORT_PC15K_PCC_DATA8                       (_UINT32_(1) << 15)

#define PIN_PB19K_PCC_DATA9                        _UINT32_(51)
#define MUX_PB19K_PCC_DATA9                        _UINT32_(10)
#define PINMUX_PB19K_PCC_DATA9                     ((PIN_PB19K_PCC_DATA9 << 16) | MUX_PB19K_PCC_DATA9)
#define PORT_PB19K_PCC_DATA9                       (_UINT32_(1) << 19)

#define PIN_PC16K_PCC_DATA9                        _UINT32_(80)
#define MUX_PC16K_PCC_DATA9                        _UINT32_(10)
#define PINMUX_PC16K_PCC_DATA9                     ((PIN_PC16K_PCC_DATA9 << 16) | MUX_PC16K_PCC_DATA9)
#define PORT_PC16K_PCC_DATA9                       (_UINT32_(1) << 16)

#define PIN_PB20K_PCC_DATA10                       _UINT32_(52)
#define MUX_PB20K_PCC_DATA10                       _UINT32_(10)
#define PINMUX_PB20K_PCC_DATA10                    ((PIN_PB20K_PCC_DATA10 << 16) | MUX_PB20K_PCC_DATA10)
#define PORT_PB20K_PCC_DATA10                      (_UINT32_(1) << 20)

#define PIN_PC17K_PCC_DATA10                       _UINT32_(81)
#define MUX_PC17K_PCC_DATA10                       _UINT32_(10)
#define PINMUX_PC17K_PCC_DATA10                    ((PIN_PC17K_PCC_DATA10 << 16) | MUX_PC17K_PCC_DATA10)
#define PORT_PC17K_PCC_DATA10                      (_UINT32_(1) << 17)

