Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/pio/pic32ck2051sg01144.h
#define PIN_PB26K_PCC_DATA11                       _UINT32_(58)
#define MUX_PB26K_PCC_DATA11                       _UINT32_(10)
#define PINMUX_PB26K_PCC_DATA11                    ((PIN_PB26K_PCC_DATA11 << 16) | MUX_PB26K_PCC_DATA11)
#define PORT_PB26K_PCC_DATA11                      (_UINT32_(1) << 26)

#define PIN_PC18K_PCC_DATA11                       _UINT32_(82)
#define MUX_PC18K_PCC_DATA11                       _UINT32_(10)
#define PINMUX_PC18K_PCC_DATA11                    ((PIN_PC18K_PCC_DATA11 << 16) | MUX_PC18K_PCC_DATA11)
#define PORT_PC18K_PCC_DATA11                      (_UINT32_(1) << 18)

#define PIN_PC19K_PCC_DATA12                       _UINT32_(83)
#define MUX_PC19K_PCC_DATA12                       _UINT32_(10)
#define PINMUX_PC19K_PCC_DATA12                    ((PIN_PC19K_PCC_DATA12 << 16) | MUX_PC19K_PCC_DATA12)
#define PORT_PC19K_PCC_DATA12                      (_UINT32_(1) << 19)

#define PIN_PC21K_PCC_DATA12                       _UINT32_(85)
#define MUX_PC21K_PCC_DATA12                       _UINT32_(10)
#define PINMUX_PC21K_PCC_DATA12                    ((PIN_PC21K_PCC_DATA12 << 16) | MUX_PC21K_PCC_DATA12)
#define PORT_PC21K_PCC_DATA12                      (_UINT32_(1) << 21)

#define PIN_PC20K_PCC_DATA13                       _UINT32_(84)
#define MUX_PC20K_PCC_DATA13                       _UINT32_(10)
#define PINMUX_PC20K_PCC_DATA13                    ((PIN_PC20K_PCC_DATA13 << 16) | MUX_PC20K_PCC_DATA13)
#define PORT_PC20K_PCC_DATA13                      (_UINT32_(1) << 20)

#define PIN_PC22K_PCC_DATA13                       _UINT32_(86)
#define MUX_PC22K_PCC_DATA13                       _UINT32_(10)
#define PINMUX_PC22K_PCC_DATA13                    ((PIN_PC22K_PCC_DATA13 << 16) | MUX_PC22K_PCC_DATA13)
#define PORT_PC22K_PCC_DATA13                      (_UINT32_(1) << 22)

#define PIN_PA10K_PCC_DEN1                         _UINT32_(10)
#define MUX_PA10K_PCC_DEN1                         _UINT32_(10)
#define PINMUX_PA10K_PCC_DEN1                      ((PIN_PA10K_PCC_DEN1 << 16) | MUX_PA10K_PCC_DEN1)
#define PORT_PA10K_PCC_DEN1                        (_UINT32_(1) << 10)

#define PIN_PC04K_PCC_DEN1                         _UINT32_(68)
#define MUX_PC04K_PCC_DEN1                         _UINT32_(10)
#define PINMUX_PC04K_PCC_DEN1                      ((PIN_PC04K_PCC_DEN1 << 16) | MUX_PC04K_PCC_DEN1)
#define PORT_PC04K_PCC_DEN1                        (_UINT32_(1) << 4)

#define PIN_PD19K_PCC_DEN1                         _UINT32_(115)
#define MUX_PD19K_PCC_DEN1                         _UINT32_(10)
#define PINMUX_PD19K_PCC_DEN1                      ((PIN_PD19K_PCC_DEN1 << 16) | MUX_PD19K_PCC_DEN1)
#define PORT_PD19K_PCC_DEN1                        (_UINT32_(1) << 19)

#define PIN_PC14K_PCC_DEN2                         _UINT32_(78)
#define MUX_PC14K_PCC_DEN2                         _UINT32_(10)
#define PINMUX_PC14K_PCC_DEN2                      ((PIN_PC14K_PCC_DEN2 << 16) | MUX_PC14K_PCC_DEN2)
#define PORT_PC14K_PCC_DEN2                        (_UINT32_(1) << 14)

#define PIN_PD02K_PCC_DEN2                         _UINT32_(98)
#define MUX_PD02K_PCC_DEN2                         _UINT32_(10)
#define PINMUX_PD02K_PCC_DEN2                      ((PIN_PD02K_PCC_DEN2 << 16) | MUX_PD02K_PCC_DEN2)
#define PORT_PD02K_PCC_DEN2                        (_UINT32_(1) << 2)

#define PIN_PD20K_PCC_DEN2                         _UINT32_(116)
#define MUX_PD20K_PCC_DEN2                         _UINT32_(10)
#define PINMUX_PD20K_PCC_DEN2                      ((PIN_PD20K_PCC_DEN2 << 16) | MUX_PD20K_PCC_DEN2)
#define PORT_PD20K_PCC_DEN2                        (_UINT32_(1) << 20)

/* ========== PORT definition for PDEC peripheral ========== */
#define PIN_PA20G_PDEC_QDI0                        _UINT32_(20)
#define MUX_PA20G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PA20G_PDEC_QDI0                     ((PIN_PA20G_PDEC_QDI0 << 16) | MUX_PA20G_PDEC_QDI0)
#define PORT_PA20G_PDEC_QDI0                       (_UINT32_(1) << 20)

#define PIN_PB04G_PDEC_QDI0                        _UINT32_(36)
#define MUX_PB04G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PB04G_PDEC_QDI0                     ((PIN_PB04G_PDEC_QDI0 << 16) | MUX_PB04G_PDEC_QDI0)
#define PORT_PB04G_PDEC_QDI0                       (_UINT32_(1) << 4)

#define PIN_PB07G_PDEC_QDI0                        _UINT32_(39)
#define MUX_PB07G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PB07G_PDEC_QDI0                     ((PIN_PB07G_PDEC_QDI0 << 16) | MUX_PB07G_PDEC_QDI0)
#define PORT_PB07G_PDEC_QDI0                       (_UINT32_(1) << 7)

#define PIN_PA21G_PDEC_QDI1                        _UINT32_(21)
#define MUX_PA21G_PDEC_QDI1                        _UINT32_(6) 
#define PINMUX_PA21G_PDEC_QDI1                     ((PIN_PA21G_PDEC_QDI1 << 16) | MUX_PA21G_PDEC_QDI1)
#define PORT_PA21G_PDEC_QDI1                       (_UINT32_(1) << 21)

#define PIN_PB05G_PDEC_QDI1                        _UINT32_(37)
#define MUX_PB05G_PDEC_QDI1                        _UINT32_(6) 
#define PINMUX_PB05G_PDEC_QDI1                     ((PIN_PB05G_PDEC_QDI1 << 16) | MUX_PB05G_PDEC_QDI1)
#define PORT_PB05G_PDEC_QDI1                       (_UINT32_(1) << 5)

#define PIN_PB08G_PDEC_QDI1                        _UINT32_(40)
#define MUX_PB08G_PDEC_QDI1                        _UINT32_(6) 
#define PINMUX_PB08G_PDEC_QDI1                     ((PIN_PB08G_PDEC_QDI1 << 16) | MUX_PB08G_PDEC_QDI1)
#define PORT_PB08G_PDEC_QDI1                       (_UINT32_(1) << 8)

#define PIN_PA22G_PDEC_QDI2                        _UINT32_(22)
#define MUX_PA22G_PDEC_QDI2                        _UINT32_(6) 
#define PINMUX_PA22G_PDEC_QDI2                     ((PIN_PA22G_PDEC_QDI2 << 16) | MUX_PA22G_PDEC_QDI2)
#define PORT_PA22G_PDEC_QDI2                       (_UINT32_(1) << 22)

#define PIN_PB09G_PDEC_QDI2                        _UINT32_(41)
#define MUX_PB09G_PDEC_QDI2                        _UINT32_(6) 
#define PINMUX_PB09G_PDEC_QDI2                     ((PIN_PB09G_PDEC_QDI2 << 16) | MUX_PB09G_PDEC_QDI2)
#define PORT_PB09G_PDEC_QDI2                       (_UINT32_(1) << 9)

#define PIN_PB13G_PDEC_QDI2                        _UINT32_(45)
#define MUX_PB13G_PDEC_QDI2                        _UINT32_(6) 
#define PINMUX_PB13G_PDEC_QDI2                     ((PIN_PB13G_PDEC_QDI2 << 16) | MUX_PB13G_PDEC_QDI2)
#define PORT_PB13G_PDEC_QDI2                       (_UINT32_(1) << 13)

