Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/pio/pic32ck2051sg01144.h
#define PIN_PC11N_PTC_DRV21                        _UINT32_(75)
#define MUX_PC11N_PTC_DRV21                        _UINT32_(13)
#define PINMUX_PC11N_PTC_DRV21                     ((PIN_PC11N_PTC_DRV21 << 16) | MUX_PC11N_PTC_DRV21)
#define PORT_PC11N_PTC_DRV21                       (_UINT32_(1) << 11)

#define PIN_PC12N_PTC_DRV22                        _UINT32_(76)
#define MUX_PC12N_PTC_DRV22                        _UINT32_(13)
#define PINMUX_PC12N_PTC_DRV22                     ((PIN_PC12N_PTC_DRV22 << 16) | MUX_PC12N_PTC_DRV22)
#define PORT_PC12N_PTC_DRV22                       (_UINT32_(1) << 12)

#define PIN_PC20N_PTC_DRV23                        _UINT32_(84)
#define MUX_PC20N_PTC_DRV23                        _UINT32_(13)
#define PINMUX_PC20N_PTC_DRV23                     ((PIN_PC20N_PTC_DRV23 << 16) | MUX_PC20N_PTC_DRV23)
#define PORT_PC20N_PTC_DRV23                       (_UINT32_(1) << 20)

#define PIN_PB16N_PTC_DRV24                        _UINT32_(48)
#define MUX_PB16N_PTC_DRV24                        _UINT32_(13)
#define PINMUX_PB16N_PTC_DRV24                     ((PIN_PB16N_PTC_DRV24 << 16) | MUX_PB16N_PTC_DRV24)
#define PORT_PB16N_PTC_DRV24                       (_UINT32_(1) << 16)

#define PIN_PB17N_PTC_DRV25                        _UINT32_(49)
#define MUX_PB17N_PTC_DRV25                        _UINT32_(13)
#define PINMUX_PB17N_PTC_DRV25                     ((PIN_PB17N_PTC_DRV25 << 16) | MUX_PB17N_PTC_DRV25)
#define PORT_PB17N_PTC_DRV25                       (_UINT32_(1) << 17)

#define PIN_PC14N_PTC_DRV26                        _UINT32_(78)
#define MUX_PC14N_PTC_DRV26                        _UINT32_(13)
#define PINMUX_PC14N_PTC_DRV26                     ((PIN_PC14N_PTC_DRV26 << 16) | MUX_PC14N_PTC_DRV26)
#define PORT_PC14N_PTC_DRV26                       (_UINT32_(1) << 14)

#define PIN_PC15N_PTC_DRV27                        _UINT32_(79)
#define MUX_PC15N_PTC_DRV27                        _UINT32_(13)
#define PINMUX_PC15N_PTC_DRV27                     ((PIN_PC15N_PTC_DRV27 << 16) | MUX_PC15N_PTC_DRV27)
#define PORT_PC15N_PTC_DRV27                       (_UINT32_(1) << 15)

#define PIN_PC16N_PTC_DRV28                        _UINT32_(80)
#define MUX_PC16N_PTC_DRV28                        _UINT32_(13)
#define PINMUX_PC16N_PTC_DRV28                     ((PIN_PC16N_PTC_DRV28 << 16) | MUX_PC16N_PTC_DRV28)
#define PORT_PC16N_PTC_DRV28                       (_UINT32_(1) << 16)

#define PIN_PC17N_PTC_DRV29                        _UINT32_(81)
#define MUX_PC17N_PTC_DRV29                        _UINT32_(13)
#define PINMUX_PC17N_PTC_DRV29                     ((PIN_PC17N_PTC_DRV29 << 16) | MUX_PC17N_PTC_DRV29)
#define PORT_PC17N_PTC_DRV29                       (_UINT32_(1) << 17)

#define PIN_PC18N_PTC_DRV30                        _UINT32_(82)
#define MUX_PC18N_PTC_DRV30                        _UINT32_(13)
#define PINMUX_PC18N_PTC_DRV30                     ((PIN_PC18N_PTC_DRV30 << 16) | MUX_PC18N_PTC_DRV30)
#define PORT_PC18N_PTC_DRV30                       (_UINT32_(1) << 18)

#define PIN_PC19N_PTC_DRV31                        _UINT32_(83)
#define MUX_PC19N_PTC_DRV31                        _UINT32_(13)
#define PINMUX_PC19N_PTC_DRV31                     ((PIN_PC19N_PTC_DRV31 << 16) | MUX_PC19N_PTC_DRV31)
#define PORT_PC19N_PTC_DRV31                       (_UINT32_(1) << 19)

#define PIN_PA18N_PTC_ECI0                         _UINT32_(18)
#define MUX_PA18N_PTC_ECI0                         _UINT32_(13)
#define PINMUX_PA18N_PTC_ECI0                      ((PIN_PA18N_PTC_ECI0 << 16) | MUX_PA18N_PTC_ECI0)
#define PORT_PA18N_PTC_ECI0                        (_UINT32_(1) << 18)

#define PIN_PA19N_PTC_ECI1                         _UINT32_(19)
#define MUX_PA19N_PTC_ECI1                         _UINT32_(13)
#define PINMUX_PA19N_PTC_ECI1                      ((PIN_PA19N_PTC_ECI1 << 16) | MUX_PA19N_PTC_ECI1)
#define PORT_PA19N_PTC_ECI1                        (_UINT32_(1) << 19)

/* ========== PORT definition for SDMMC0 peripheral ========== */
#define PIN_PA10I_SDMMC0_SDCD                      _UINT32_(10)
#define MUX_PA10I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PA10I_SDMMC0_SDCD                   ((PIN_PA10I_SDMMC0_SDCD << 16) | MUX_PA10I_SDMMC0_SDCD)
#define PORT_PA10I_SDMMC0_SDCD                     (_UINT32_(1) << 10)

#define PIN_PA12I_SDMMC0_SDCD                      _UINT32_(12)
#define MUX_PA12I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PA12I_SDMMC0_SDCD                   ((PIN_PA12I_SDMMC0_SDCD << 16) | MUX_PA12I_SDMMC0_SDCD)
#define PORT_PA12I_SDMMC0_SDCD                     (_UINT32_(1) << 12)

#define PIN_PD12I_SDMMC0_SDCD                      _UINT32_(108)
#define MUX_PD12I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PD12I_SDMMC0_SDCD                   ((PIN_PD12I_SDMMC0_SDCD << 16) | MUX_PD12I_SDMMC0_SDCD)
#define PORT_PD12I_SDMMC0_SDCD                     (_UINT32_(1) << 12)

#define PIN_PD10I_SDMMC0_SDCK                      _UINT32_(106)
#define MUX_PD10I_SDMMC0_SDCK                      _UINT32_(8) 
#define PINMUX_PD10I_SDMMC0_SDCK                   ((PIN_PD10I_SDMMC0_SDCK << 16) | MUX_PD10I_SDMMC0_SDCK)
#define PORT_PD10I_SDMMC0_SDCK                     (_UINT32_(1) << 10)

#define PIN_PD06I_SDMMC0_SDCMD                     _UINT32_(102)
#define MUX_PD06I_SDMMC0_SDCMD                     _UINT32_(8) 
#define PINMUX_PD06I_SDMMC0_SDCMD                  ((PIN_PD06I_SDMMC0_SDCMD << 16) | MUX_PD06I_SDMMC0_SDCMD)
#define PORT_PD06I_SDMMC0_SDCMD                    (_UINT32_(1) << 6)

#define PIN_PD07I_SDMMC0_SDDAT0                    _UINT32_(103)
#define MUX_PD07I_SDMMC0_SDDAT0                    _UINT32_(8) 
#define PINMUX_PD07I_SDMMC0_SDDAT0                 ((PIN_PD07I_SDMMC0_SDDAT0 << 16) | MUX_PD07I_SDMMC0_SDDAT0)
#define PORT_PD07I_SDMMC0_SDDAT0                   (_UINT32_(1) << 7)

#define PIN_PD11I_SDMMC0_SDDAT1                    _UINT32_(107)
#define MUX_PD11I_SDMMC0_SDDAT1                    _UINT32_(8) 
#define PINMUX_PD11I_SDMMC0_SDDAT1                 ((PIN_PD11I_SDMMC0_SDDAT1 << 16) | MUX_PD11I_SDMMC0_SDDAT1)
#define PORT_PD11I_SDMMC0_SDDAT1                   (_UINT32_(1) << 11)

