Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/pio/pic32ck2051sg01144.h
#define PIN_PB11G_TCC3_WO6                         _UINT32_(43)
#define MUX_PB11G_TCC3_WO6                         _UINT32_(6) 
#define PINMUX_PB11G_TCC3_WO6                      ((PIN_PB11G_TCC3_WO6 << 16) | MUX_PB11G_TCC3_WO6)
#define PORT_PB11G_TCC3_WO6                        (_UINT32_(1) << 11)

#define PIN_PA28F_TCC3_WO6                         _UINT32_(28)
#define MUX_PA28F_TCC3_WO6                         _UINT32_(5) 
#define PINMUX_PA28F_TCC3_WO6                      ((PIN_PA28F_TCC3_WO6 << 16) | MUX_PA28F_TCC3_WO6)
#define PORT_PA28F_TCC3_WO6                        (_UINT32_(1) << 28)

#define PIN_PB12G_TCC3_WO7                         _UINT32_(44)
#define MUX_PB12G_TCC3_WO7                         _UINT32_(6) 
#define PINMUX_PB12G_TCC3_WO7                      ((PIN_PB12G_TCC3_WO7 << 16) | MUX_PB12G_TCC3_WO7)
#define PORT_PB12G_TCC3_WO7                        (_UINT32_(1) << 12)

#define PIN_PA19F_TCC3_WO7                         _UINT32_(19)
#define MUX_PA19F_TCC3_WO7                         _UINT32_(5) 
#define PINMUX_PA19F_TCC3_WO7                      ((PIN_PA19F_TCC3_WO7 << 16) | MUX_PA19F_TCC3_WO7)
#define PORT_PA19F_TCC3_WO7                        (_UINT32_(1) << 19)

/* ========== PORT definition for TCC4 peripheral ========== */
#define PIN_PA11F_TCC4_WO0                         _UINT32_(11)
#define MUX_PA11F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PA11F_TCC4_WO0                      ((PIN_PA11F_TCC4_WO0 << 16) | MUX_PA11F_TCC4_WO0)
#define PORT_PA11F_TCC4_WO0                        (_UINT32_(1) << 11)

#define PIN_PA13F_TCC4_WO0                         _UINT32_(13)
#define MUX_PA13F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PA13F_TCC4_WO0                      ((PIN_PA13F_TCC4_WO0 << 16) | MUX_PA13F_TCC4_WO0)
#define PORT_PA13F_TCC4_WO0                        (_UINT32_(1) << 13)

#define PIN_PA20F_TCC4_WO0                         _UINT32_(20)
#define MUX_PA20F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PA20F_TCC4_WO0                      ((PIN_PA20F_TCC4_WO0 << 16) | MUX_PA20F_TCC4_WO0)
#define PORT_PA20F_TCC4_WO0                        (_UINT32_(1) << 20)

#define PIN_PB12F_TCC4_WO0                         _UINT32_(44)
#define MUX_PB12F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PB12F_TCC4_WO0                      ((PIN_PB12F_TCC4_WO0 << 16) | MUX_PB12F_TCC4_WO0)
#define PORT_PB12F_TCC4_WO0                        (_UINT32_(1) << 12)

#define PIN_PA12F_TCC4_WO1                         _UINT32_(12)
#define MUX_PA12F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PA12F_TCC4_WO1                      ((PIN_PA12F_TCC4_WO1 << 16) | MUX_PA12F_TCC4_WO1)
#define PORT_PA12F_TCC4_WO1                        (_UINT32_(1) << 12)

#define PIN_PA14F_TCC4_WO1                         _UINT32_(14)
#define MUX_PA14F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PA14F_TCC4_WO1                      ((PIN_PA14F_TCC4_WO1 << 16) | MUX_PA14F_TCC4_WO1)
#define PORT_PA14F_TCC4_WO1                        (_UINT32_(1) << 14)

#define PIN_PA21F_TCC4_WO1                         _UINT32_(21)
#define MUX_PA21F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PA21F_TCC4_WO1                      ((PIN_PA21F_TCC4_WO1 << 16) | MUX_PA21F_TCC4_WO1)
#define PORT_PA21F_TCC4_WO1                        (_UINT32_(1) << 21)

#define PIN_PB18F_TCC4_WO1                         _UINT32_(50)
#define MUX_PB18F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PB18F_TCC4_WO1                      ((PIN_PB18F_TCC4_WO1 << 16) | MUX_PB18F_TCC4_WO1)
#define PORT_PB18F_TCC4_WO1                        (_UINT32_(1) << 18)

/* ========== PORT definition for TCC5 peripheral ========== */
#define PIN_PA15F_TCC5_WO0                         _UINT32_(15)
#define MUX_PA15F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PA15F_TCC5_WO0                      ((PIN_PA15F_TCC5_WO0 << 16) | MUX_PA15F_TCC5_WO0)
#define PORT_PA15F_TCC5_WO0                        (_UINT32_(1) << 15)

#define PIN_PA22F_TCC5_WO0                         _UINT32_(22)
#define MUX_PA22F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PA22F_TCC5_WO0                      ((PIN_PA22F_TCC5_WO0 << 16) | MUX_PA22F_TCC5_WO0)
#define PORT_PA22F_TCC5_WO0                        (_UINT32_(1) << 22)

#define PIN_PB00F_TCC5_WO0                         _UINT32_(32)
#define MUX_PB00F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PB00F_TCC5_WO0                      ((PIN_PB00F_TCC5_WO0 << 16) | MUX_PB00F_TCC5_WO0)
#define PORT_PB00F_TCC5_WO0                        (_UINT32_(1) << 0)

#define PIN_PB19F_TCC5_WO0                         _UINT32_(51)
#define MUX_PB19F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PB19F_TCC5_WO0                      ((PIN_PB19F_TCC5_WO0 << 16) | MUX_PB19F_TCC5_WO0)
#define PORT_PB19F_TCC5_WO0                        (_UINT32_(1) << 19)

#define PIN_PA16F_TCC5_WO1                         _UINT32_(16)
#define MUX_PA16F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PA16F_TCC5_WO1                      ((PIN_PA16F_TCC5_WO1 << 16) | MUX_PA16F_TCC5_WO1)
#define PORT_PA16F_TCC5_WO1                        (_UINT32_(1) << 16)

#define PIN_PA23F_TCC5_WO1                         _UINT32_(23)
#define MUX_PA23F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PA23F_TCC5_WO1                      ((PIN_PA23F_TCC5_WO1 << 16) | MUX_PA23F_TCC5_WO1)
#define PORT_PA23F_TCC5_WO1                        (_UINT32_(1) << 23)

#define PIN_PB01F_TCC5_WO1                         _UINT32_(33)
#define MUX_PB01F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PB01F_TCC5_WO1                      ((PIN_PB01F_TCC5_WO1 << 16) | MUX_PB01F_TCC5_WO1)
#define PORT_PB01F_TCC5_WO1                        (_UINT32_(1) << 1)

#define PIN_PB20F_TCC5_WO1                         _UINT32_(52)
#define MUX_PB20F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PB20F_TCC5_WO1                      ((PIN_PB20F_TCC5_WO1 << 16) | MUX_PB20F_TCC5_WO1)
#define PORT_PB20F_TCC5_WO1                        (_UINT32_(1) << 20)

/* ========== PORT definition for TCC6 peripheral ========== */
#define PIN_PB16F_TCC6_WO0                         _UINT32_(48)
#define MUX_PB16F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PB16F_TCC6_WO0                      ((PIN_PB16F_TCC6_WO0 << 16) | MUX_PB16F_TCC6_WO0)
#define PORT_PB16F_TCC6_WO0                        (_UINT32_(1) << 16)

#define PIN_PB23F_TCC6_WO0                         _UINT32_(55)
#define MUX_PB23F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PB23F_TCC6_WO0                      ((PIN_PB23F_TCC6_WO0 << 16) | MUX_PB23F_TCC6_WO0)
#define PORT_PB23F_TCC6_WO0                        (_UINT32_(1) << 23)

